Repository: 84000/data-translation-memory
Catalog: Toh_103-The_Teaching_by_the_Child_Inconceivable_Radiance-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ལས་ཀྱི་སྒྲིབ་པ་གང་ཞིག་གིས། ཁྱེའུ་འདི་བུད་མེད་ཁྱིམ་ཐབ་མ་མཆིས་པའི་མངལ་དུ་སྐྱེས་ལ། དེར་ཡང་ཁང་སྟོང་དུ་བོར་བར་གྱུར།
en: what sort of obscuration of karma caused him to be born from the womb of a woman without a husband and later abandoned in that empty dwelling?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན།
en: The Bhagavān answered him, “Great king,

source: འདི་ནས་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་འདས་པ། དེའི་ཚེ་དེའི་དུས་ན།
en: once, in the distant past, ninety-one eons ago,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: the thus-gone, worthy, perfect buddha, the one with perfect knowledge and conduct, the blissful one, the knower of the world, the charioteer who tames beings, the unexcelled, the teacher of gods and humans, the blessed buddha known as Vipaśyin appeared in the world.

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན།
en: “Great king, in those days, at that time,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་དེའི་གསུང་རབ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ཤིག་བྱུང་སྟེ། ལྷ་བཟང་ཞེས་བྱ་བ་དང་། ས་ཞེས་བྱ་བའོ། །
en: there were two bodhisattvas, Divine Excellence and Earth, who attended the sublime discourses of the blessed buddha Vipaśyin.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིང་། །
en: In particular, the bodhisattva known as Divine Excellence was one who would no longer regress;

source: དོན་དུ་ཉུང་བ། བྱ་བ་ཉུང་བ། དབེན་པ་ལ་དགའ་བ། བསམ་གཏན་དང་། མངོན་པར་ཤེས་པས་རྣམ་པར་བརྩེ་བར་གྱུར་ཏོ། །
en: he had few pursuits and few activities, enjoyed solitude, and was filled with loving kindness due to his powers of concentration and advanced cognition.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ས་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པར་མ་གྱུར་ཏེ།
en: “As for the bodhisattva known as Earth, he was not very well versed in the Dharma and

source: ལྷ་བཟང་གི་གཡོག་བྱེད་དོ། །
en: so served as the attendant of Divine Excellence.

source: དེ་ཧ་ཅང་གྲོང་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དག་ཏུ་འཇུག་སྟེ།
en: He frequently went into neighboring villages, towns, townships, and palaces and

source: ཞུགས་ནས་ཀྱང་བྱ་བ་མང་ཞིང་བྱེད་པ་མང་བར་གྱུར་ནས།
en: there would busy himself with many tasks and activities.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་དེས་དེ་ལ་ཁྱོད་ཅིའི་ཕྱིར་རྣལ་འབྱོར་དང་སྤོང་བ་ལ་བརྩོན་པར་མི་བྱེད་པར་ཧ་ཅང་བྱ་བ་མང་ཞིང་ཧ་ཅང་བྱེད་པ་མང་ཞེས་བསྒོ་ཞིང་བསྟན་ཏོ། །
en: Thus, the bodhisattva Divine Excellence would reprimand him, saying, ‘Why are you busying yourself with so many tasks and activities instead of putting your effort into practice and renunciation?’

source: དེས་དེ་ལ་ཡང་དང་ཡང་བསྐུལ་བས་དེ་ཁྲོས་ཤིང་འཁྲུགས་ཏེ་ཡིད་མ་རངས་ནས། གནོད་སེམས་སུ་གྱུར་པ་དེས་ལུས་དང་སེམས་མ་རུང་བར་བྱས་ཏེ།
en: “Over and over again Divine Excellence exhorted him, making Earth irritated and agitated, turning him unpleasant and then abusive, until he became both physically and mentally malicious.

source: ངན་དུ་བསམས་ནས་ཚིག་རྩུབ་པོ་སྨྲས་པ།
en: He voiced his vile thoughts in the coarsest language, saying,

source: ནལ་གྱི་བུ། སྦྱར་མའི་བུ། སྐྱེས་པ་གཞན་ལས་གྲུབ་པ་ཁྱོད་ཀྱི་ཕ་མ་ཡང་མེད་ན།
en: ‘You bastard, you son of a whore, your father was a cuckold. Since you don’t even have a proper father and mother,

source: ཁྱོད་ལ་ཤེས་རབ་བམ། ཚུལ་ཁྲིམས་ལྟ་ག་ལ་ཡོད་ཅེས་དེས་ངན་དུ་བསམས་ཏེ།
en: it is ridiculous to think that you could have insight or disciplined conduct.’

source: ཚིག་རྩུབ་པོ་སྨྲས་པ། མི་མཐོལ་མི་འཆགས་མི་འདོར་གྱི།
en: “With the worst intentions he spoke these crude words, and without confession, contrition, or rejection,

source: ཞེ་ལ་འཛིན་ཏེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་དེ་ལ་རྟག་ཏུ་ངན་སེམས་དང་ལྡན་ཞིང་བྱམས་པའི་སེམས་མེད་པར་གྱུར་ཏོ། །
en: he held his grudge, continuing to harbor ill will toward the bodhisattva Divine Excellence, and he had not the slightest affection for him.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་གིས་ཀྱང་དེ་སྣོད་མ་ཡིན་ནོ་སྙམ་ནས་བཀྱེད་པ་དང་། དེ་དེ་བས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་ལ་ངན་དུ་སེམས་ཤིང་བསྔགས་པ་མ་ཡིན་པ་བརྗོད་དེསྙན་པ་མ་ཡིན་པ་དང་། གྲགས་པ་མ་ཡིན་པ་དང་། ཚིགས་སུ་བཅད་པ་མ་ཡིན་པ་བརྗོད་དོ། །
en: “The bodhisattva Divine Excellence, moreover, thought that Earth was no longer a fitting vessel and withdrew from him, spurring Earth to think even worse of the bodhisattva Divine Excellence and to speak to him in the most uncomplimentary, caustic, unvenerable, and unmeasured terms.

source: དེ་ལས་བསགས་ཤིང་ཚོགས་སུ་བྱས་པ་དེས་ལུས་ཞིག་སྟེ། ཤི་བའི་འོག་ཏུ་བུད་མེད་ཁྱིམ་ཐབ་མེད་པའི་མངལ་དུ་སྐྱེས་སོ། །
en: “Because of the karma Earth accumulated and gathered in this way, his body was ruined, and in the wake of his death, he was reborn to a woman who gave birth to him out of wedlock.

source: བྱང་ཆུབ་ཀྱི་སེམས་བསྲུངས་པས་དེས་ན་སེམས་ཅན་དམྱལ་བར་ནི་མ་སྐྱེས་སོ། །
en: Because he had maintained the awakening mind, however, his actions did not cause him to take rebirth as a being in hell.

source: དེ་བཙས་མ་ཐག་ཏུ་བུད་མེད་དེས་ལམ་སྲང་ཆེན་པོར་བོར་ཏེ།
en: “As soon as he was born, the woman abandoned him along a major thoroughfare,

source: དེར་དེ་ཁྱི་དང་། སྤྱང་ཀི་དང་། ཅེ་སྤྱང་རྣམས་ཀྱིས་ཟོས་སོ། །
en: where he was eaten by dogs, jackals, and wolves.

source: རྒྱལ་པོ་ཆེན་པོ་ཚུལ་འདི་འདྲ་བར་འདི་བསྐལ་པ་དགུ་བཅུར་སྡུག་བསྔལ་འདི་ལྟ་བུ་དང་།
en: Great king, in a similar fashion, over the course of ninety eons, he suffered like this, in the same miserable way;

source: ཉམ་ཐག་པ་འདི་ལྟ་བུས་འཆི་བའི་དུས་བྱས་ཤིང་བཙས་པ་བཙས་པ་ན་ཡང་བོར་བར་གྱུར་ཏེ
en: he died and was reborn and once reborn was abandoned.

source: ཡང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདི་སྐད་དུ་ནལ་གྱི་བུ་སྦྱར་མའི་བུ་འདི་ལ་ཁྱི་དང་སྤྱང་ཀི་དང་། ཅེ་སྤྱང་རྣམས་ཟའོ་ཞེས་འཛེར་ཏོ། །
en: The common folk would say, ‘That bastard, that child of a whore—let the dogs, jackals, and wolves eat him!’

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་ས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སོམ་ཉིའམ།
en: “Great king, if you are uncertain, if you entertain doubt as to whether the one known as the bodhisattva Earth in those days, at that time,

source: ཡིད་གཉིས་ཟ་བར་གྱུར་ན་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: may have been someone else, you need not wonder any longer.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask, ‘Why is that?’

source: ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Well, it is because this child Inconceivable Radiance was the one known in those days, at that time, as the bodhisattva Earth.

source: རྒྱལ་པོ་ཆེན་པོ་འདིའི་ལས་ཀྱི་སྒྲིབ་པ་ནི་ཟད།
en: “Great king, his obscuration of karma has now been exhausted.

source: ཀུན་ནས་ཉོན་མོངས་པའི་སེམས་ནི་རྣམ་པར་སྦྱངས།
en: His impure mind has been purified.

source: དེ་བཞིན་གཤེགས་པ་ནི་མཉེས་པར་བྱས།
en: He has pleased the Tathāgata.

source: ངན་འགྲོ་ཐམས་ཅད་ནི་བཅད་ནས། ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདིས་སངས་རྒྱས་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་མཉེས་པར་བྱས་ཤིང་།
en: Cutting off rebirth in all the lower realms, this child Inconceivable Radiance has pleased sixty-four million buddhas,

source: བསྟི་སྟང་དུ་བྱས། རི་མོ་བྱས། མཆོད་པ་བྱས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དྲུང་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: has honored them, venerated them, and revered them, and has conducted himself with sanctity before them.

source: ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་ཡང་བརྩོན་པར་གྱུར་ཏོ། །
en: He has been diligent in the dedicated pursuit of Dharma as well.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་སྔོན་གྱི་དགེ་བའི་རྩ་བ་འདིས་བདག་ཉིད་ཆེན་པོ་འདི་ཐོབ་བོ། །
en: “Great king, through his past roots of virtue, he has achieved this illustrious state.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་ན་ལས་ནག་པོ་དང་། དཀར་པོ་དག་ཆུད་ཟ་བར་འགྱུར་བ་མེད་དོ། །
en: Great king, in this way, black deeds and white deeds are never squandered.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་མཁས་པས་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་བསྡམ་པར་བྱ་སྟེ།
en: Great king, since that is the case, the wise are circumspect about their physical, verbal, and mental acts,

source: སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱའོ། །
en: abstaining from evil even at the cost of their lives.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The king of the state of Kośala, Prasenajit, then asked the Bhagavān,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་བཟང་ཞེས་བགྱི་བར་གྱུར་པ་དེས།
en: “Bhagavān, the bodhisattva who was called Divine Excellence—

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ལགས་སམ།
en: did he ever attain unsurpassed and perfect awakening? Or

source: འོན་ཏེ་ད་དུང་དུ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་བགྱིད།
en: is he still, even now, engaging in the conduct of a bodhisattva?”

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་བཟང་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་དེ
en: “Great king, the bodhisattva mahāsattva Divine Excellence conducts himself with sanctity in the buddha realm of the tathāgata Akṣobhya,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔལ་འབྱུང་ཞེས་བྱའོ། །
en: where he is known as the bodhisattva mahāsattva Śrīsambhava.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་གསལ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The king of Kośala, Prasenajit, then said to the Bhagavān:

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་གུས་པར་བགྱིས་ཏེ།
en: “Bhagavān, a noble son or daughter is supposed to act respectfully,

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་བསྙེན་པར་བགྱིའོ། །
en: to serve spiritual masters,

source: བསྟེན་པར་བགྱིའོ། །
en: to attend them,

source: བསྙེན་བཀུར་བགྱིའོ། །
en: and to venerate them.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: One may ask, ‘What is the value of doing so?’

source: བཅོམ་ལྡན་འདས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་ཅིང་བསྟེན་ཏེ།
en: “Bhagavān, if one attends, serves, and

source: བསྙེན་བཀུར་བགྱིས་ན་དགེ་བའི་ཆོས་ཐོབ་པར་འགྱུར་རོ། །
en: venerates a spiritual master, one acquires virtuous qualities.

source: དགེ་བའི་ཆོས་ཐོབ་པས་བསམ་པ་དགེ་བར་འགྱུར་རོ། །
en: Through acquiring virtuous qualities, one’s frame of mind becomes virtuous.

source: བསམ་པ་དགེ་བས་སྦྱོར་བ་དགེ་བར་འགྱུར་རོ། །
en: When one’s frame of mind is virtuous, one trains in virtue.

source: སྦྱོར་བ་དགེ་བས་དགེ་བའི་ལས་བགྱིད་པར་འགྱུར་རོ། །
en: “Through training in virtue, one performs virtuous deeds.

source: ལས་དགེ་བས་འགྲོ་བ་དགེ་བར་མཆི་བར་འགྱུར་རོ། །
en: Through virtuous deeds, one will have a virtuous existence.

source: འགྲོ་བ་དགེ་བས་དགེ་བའི་གྲོགས་པོ་མགུ་བར་བགྱིད་དོ། །
en: Due to a virtuous existence, one enjoys virtuous companions.

source: གྲོགས་པོ་དགེ་བས་སྡིག་པའི་ལས་མི་བགྱིད་དོ། །
en: In virtuous company, sinful acts are not performed.

source: བགྱིད་པར་མི་འགྱུར་རོ། །
en: One will not engage in sinful acts.

source: སྡིག་པ་མ་བགྱིས་ཤིང་དགེ་བའི་ལས་བགྱིས་པས་བདག་ལ་གདུང་བར་མི་འགྱུར།
en: “By abstaining from sinful acts and engaging in virtue, one will not be tormented,

source: གཞན་ལ་གདུང་བར་མི་འགྱུར་རོ། །
en: and others will not be tormented.

source: བདག་དང་གཞན་རྗེས་སུ་སྲུང་བས་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Through affording protection to oneself and others, the path to awakening will be completed.

source: བྱང་ཆུབ་ཀྱི་ལམ་ལ་གནས་པས་ལམ་ངན་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་བགྱིད་ནུས་པ་དང་། སྐལ་བ་མཆིས་པ་དང་། མཐུ་དང་ལྡན་པར་འགྱུར་རོ། །
en: “By staying on the path to awakening, one will have the ability and opportunity to effectively serve the welfare of beings who have embarked on inferior paths.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ། །
en: The Bhagavān remarked, “Great king, well said!

source: ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་སོ། །
en: Well said! You have spoken well!

source: རྒྱལ་པོ་ཆེན་པོ་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་ཏེ།
en: Great king, by serving one’s spiritual master,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་གྱི་ཆོས་ཉིད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: one will perfect all the qualities that characterize a bodhisattva mahāsattva.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The child Inconceivable Radiance then said to the Bhagavān,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་།
en: “Bhagavān, what are the various qualities a bodhisattva should possess in order to swiftly awaken to unsurpassed and perfect buddhahood and

source: ཟབ་མོའི་ཆོས་རྣམས་ལ་ཡང་བཟོད་པ་ཐོབ་པར་འགྱུར།
en: to gain acceptance of even the most profound Dharmas?”

source: ཁྱེའུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། ཟབ་མོའི་ཆོས་རྣམས་ལ་ཡང་བཟོད་པ་ཐོབ་པར་འགྱུར་ཏེ
en: “Child, a bodhisattva who possesses four qualities will swiftly awaken to unsurpassed and perfect buddhahood and gain acceptance of even the most profound Dharmas.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཤེས་པ་ལ་འཇུག་པ་དང་། ཆད་པ་དང་།
en: “They are comprehension of interdependence; rejection of eternalism and nihilism;

source: རྟག་པ་རྣམ་པར་སྤོང་བ་དང་སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པར་འཇུག་པ་དང་།
en: the understanding that there are no beings, no living creatures, and no persons;

source: སྟོང་པ་ཉིད་ལ་མོས་ཤིང་། སྟོང་པ་ཉིད་ལ་སྤྱོད་ཡུལ་བ་སྟེ།
en: and an interest in and experience of emptiness.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་།
en: “A bodhisattva who possesses these four qualities will swiftly awaken to unsurpassed and perfect buddhahood and

source: ཟབ་མོའི་ཆོས་རྣམས་ལ་ཡང་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: gain acceptance of even the most profound Dharmas.

source: ཁྱེའུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Child, in addition, a bodhisattva who possesses four other qualities will swiftly awaken to unsurpassed and perfect buddhahood.

source: སྔོན་གྱི་མཐའ་དབེན་པ་དང་། ཕྱི་མའི་མཐའ་མི་འཕོ་བ་དང་། ད་ལྟར་བྱུང་བ་འཇིག་པར་ཤེས་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་དེ་བཞི་པོ་དེ་དག་གོ། །
en: “Leaving the past behind, not projecting into the future, knowing how to extinguish what arises right now, and knowing the sameness of the three times—those are the four.

source: གཞན་ཡང་བཞི་སྟེ།
en: “There is yet another set of four.

source: ལུས་དབེན་པ་དང་། སེམས་དབེན་པ་དང་། ཆོས་དབེན་པ་དང་། ལས་དབེན་པ་སྟེ། བཞི་པོ་དེ་དག་གོ། །
en: Physical isolation, mental isolation, isolation from phenomena, and isolation from action—those are the four.

source: སངས་རྒྱས་ལ་ཆོས་ཉིད་དུ་མཐོང་གི་གཟུགས་སུ་མ་ཡིན་པ་དང་།
en: Seeing the Buddha as reality itself and not as a form;

source: ཆོས་ལ་འདོད་ཆགས་དང་བྲལ་བར་མཐོང་གི་ཡི་གེ་དང་། ངེས་པའི་ཚིག་ཏུ་མ་ཡིན་པ་དང་།
en: seeing the Dharma as detachment from desire and not as terms and definitions;

source: དགེ་འདུན་ལ་འདུས་མ་བྱས་སུ་མཐོང་གི་ཚོགས་སུ་མ་ཡིན་པ་དང་།
en: seeing the saṅgha as noncomposite and not as an assemblage;

source: ཤེས་རབ་ཀྱི་མིག་ཡོངས་སུ་དག་པར་འགྱུར་བ་སྟེ། བཞི་པོ་དེ་དག་གོ། །
en: and purification of the eyes of insight—those are the four.

source: བསྡུ་བའི་དངོས་པོ་མི་གཏོང་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་།
en: They are perfecting the six transcendent virtues by not relinquishing the modes of attraction;

source: ཐབས་དང་ཤེས་རབ་ལ་མཁས་པ་དང་།
en: expertise in insight and skillful means;

source: སེམས་ཅན་མེད་པར་རྣམ་པར་དཔྱོད་པ་དང་སྙིང་རྗེ་ཆེན་པོ་སྟེ།
en: precise discernment that there are no beings; and great compassion.

source: ཁྱེའུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་།
en: “Child, a bodhisattva who possesses these four qualities will swiftly awaken to unsurpassed and perfect buddhahood and

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཞི་པ་བསྒྲུབ་པ་བསྟན་པ་འདི་བཤད་པ་ན་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པར་ཐོབ་པར་གྱུར་ཏེ།
en: As the Bhagavān gave this teaching presenting the fourfold attainments, the child Inconceivable Radiance gained acceptance of the fact that phenomena do not arise and

source: དེ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་པར་གྱུར་ཏོ། །
en: was so joyous, so overjoyed, that he himself actually floated up into the sky to the height of seven palm trees.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: At that point, the Bhagavān smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ།
en: As is the nature of things when blessed buddhas smile,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་འཕྲོ་བ་ཁ་དོག་སྣ་ཚོགས། ཁ་དོག་དུ་མ་བྱུང་བ་འདི་ལྟ་སྟེ།
en: lights of various colors radiated from the mouth of the Bhagavān.

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་སྟེ།
en: The lights appeared in many different colors, such as blue, yellow, red, white, violet, and silver.

source: ཁ་དོག་དུ་མ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བར་བྱས་ཏེ།
en: Those multicolored lights illuminated the infinite and boundless worlds of the universe,

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་བྱུང་ནས། ཟླ་བ་དང་ཉི་མ་རྣམས་ཀྱི་འོད་མོག་མོག་པོར་བྱས་ཏེ།
en: manifesting even as far as Brahmā’s domain and making the very sun and moon seem lackluster.

source: སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: The lights then reversed course and vanished into the crown of the Bhagavān’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ།
en: Venerable Ānanda then rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Joining his palms, he bowed toward the Bhagavān.

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་དོན་དེ་ཞུས་པ།
en: In the rhythm of verse, he requested an explanation of the meaning of this from the Bhagavān:

source: བལྟ་སྡུག་བལྟར་འོས་གཟུགས་དང་མཚན་རྣམས་དང་། །
en: “Your figure is lovely and worthy to behold,

source: དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་རབ་མཛེས་ཤིང་། །
en: Gracefully adorned with marks and signs most fine,

source: འོད་ཀྱི་དཀྱིལ་འཁོར་འོད་ཀྱིས་འོད་མཛེས་པ། །
en: And shining beautifully within a circle of lights.

source: འཛུམ་པ་མཛད་དེ་བདག་ལ་བསྟན་དུ་གསོལ། །
en: Please explain your smile to me!

source: ཚུལ་ཁྲིམས་འཕགས་ཤིང་སྤྱོད་པ་ལེགས་སྤྱད་པ། །ཏིང་འཛིན་ཤེས་རབ་བསགས་པའི་ཡེ་ཤེས་འོད། །
en: “You are engaged in exemplary conduct with superior discipline, And with the light of wisdom gathered from absorption and insight,

source: རྣམ་གྲོལ་སྙིང་པོ་སྟོབས་ལྡན་ཡང་དག་གཟིགས། །
en: And the strength of the essence of liberation, you see perfectly.

source: བཟོད་པའི་སྟོབས་ལྡན་སྟོབས་ཀྱི་ཤུགས་མངའ་བ། །
en: “With the strength of the power of acceptance

source: བརྩོན་འགྲུས་མངོན་པར་འཕགས་ཏེ་མི་བསྐྱོད་པ། །
en: And diligence eminently superior and unwavering,

source: མིག་ཏུ་སྡུག་ཅིང་བདེན་པ་བཞི་གཟིགས་པ། །
en: You are pleasing to the eye and behold the four truths.

source: རྡོ་རྗེའི་སྐུ་མངའ་སྲ་བརྟན་མི་ཤིགས་པ། །
en: “You have a vajra body, hard, stable, and indestructible,

source: སྲེད་མེད་བུ་མཐུ་སྲེད་མེད་བུ་བས་མཆོག །
en: As mighty as Nārāyaṇa—even greater than Nārāyaṇa.

source: ཚངས་དབྱངས་སྒྲ་སྙན་འཇམ་པའི་དབྱངས་ལྡན་པ། །
en: Your voice is gentle, the sweet voice of Brahmā.

source: བཞུགས་ཀྱང་ཚངས་དང་དེ་བཞིན་ལྷ་ཚོགས་ཀྱིས། །
en: “Brahmā and likewise the other gods who have gathered

source: དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་མ་མཐོང་ལ། །གུས་དང་བཅས་པས་ཀུན་ནས་བལྟ་བགྱིད་པ། །
en: Behold you with reverence, yet even though the Tathāgata is seated They cannot see the summit of your crown.

source: ཁྱོད་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་དམ་པ་བསྐོར། །
en: “You turn the sacred wheel of Dharma.

source: མི་རྟག་སྒྲས་ནི་ལྷ་དང་ལྷ་མིན་དང་། །དེ་བཞིན་ཀླུ་དང་གནོད་སྦྱིན་རབ་བསྐྱོད་པ། །
en: The message of impermanence deeply moves Gods, asuras, nāgas, and yakṣas alike.

source: !སྣང་བ་མཉེས་ཤིང་མུན་པ་རྣམས་བྲལ་བ། །
en: “You have discovered radiance and removed all darkness,

source: ཀུན་ནས་སྤྱན་མངའ་མཉམ་པ་ཉིད་བཞུགས་པ། །
en: You abide in equanimity with eyes that take in all,

source: ཡོན་ཏན་མཆོག་མངའ་ཡོན་ཏན་སྙིང་པོ་བསྟན། །
en: Possess superior qualities, and display essential qualities.

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: With those words he made his request.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān then answered the venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཤིང་ཏ་ལ་བདུན་སྲིད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་འདུག་པ་མཐོང་ངམ།
en: “Ānanda, do you see the child Inconceivable Radiance hovering in the space above, at the height of seven palm trees?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: Ānanda replied, “Yes, Bhagavān, I do see him.”

source: !ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བསྐལ་པ་གྲངས་མེད་པ་བརྒྱའི་འོག་ཏུ་བསྐལ་པ་ཀུན་ཏུ་སྣང་བྱེད་ཅེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྤྱོད་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་།
en: “Ānanda, this bodhisattva mahāsattva Inconceivable Radiance, after one hundred incalculable eons, in the eon called Universal Illumination, in the realm known as Fully Cleansed, will make his appearance in the world as the thus-gone, worthy, perfect buddha,

source: ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་བསྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱ་བ་ཉིད་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: the one with knowledge and good conduct, the blissful one, the knower of the world, the charioteer who tames beings, the unexcelled, the teacher of gods and humans known precisely as the blessed buddha Inconceivable Radiance.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྤྱོད་པ་དེ་ནི་འདི་ལྟ་བུར་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ།
en: “Ānanda, that realm Fully Cleansed will become utterly pure in the following way:

source: དཔེར་ན་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ལྟ་བུར་འགྱུར་རོ། །
en: as a comparison, it will be like what is enjoyed and experienced by the Paranirmitavaśavartin gods.

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་བར་གྱི་བསྐལ་པ་ཉི་ཤུར་གནས་པར་འགྱུར་རོ། །
en: That tathāgata will remain there for twenty intermediate eons.

source: དེ་ལ་ཉན་ཐོས་བརྒྱད་ཁྲིའི་དགེ་འདུན་ཡོད་པར་འགྱུར་རོ། །
en: He will have a saṅgha of eighty thousand listeners.

source: བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་གི་དགེ་འདུན་ཡོད་པར་འགྱུར་རོ། །
en: There will be a bodhisattva saṅgha of thirty-two thousand.

source: ཀུན་དགའ་བོ་ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་རྣམ་པར་སྤྱོད་པ་ཞེས་བྱ་ཞིང་། བསྐལ་པ་ཀུན་ཏུ་སྣང་བྱེད་ཅེས་བྱ་བར་འགྱུར་ཞེ་ན།
en: “Ānanda, you may wonder why that realm will be called Fully Cleansed and the eon Universal Illumination.

source: ཀུན་དགའ་བོ་བར་གྱི་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྔོན་ནམ་ཡང་དེ་བཞིན་གཤེགས་པ་མ་བྱུང་སྟེ།
en: Ānanda, over the course of hundreds and thousands of prior intermediate eons, no tathāgata ever appears in that buddhafield.

source: དེར་དེ་བཞིན་གཤེགས་པ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་འབྱུང་བར་འགྱུར་བ་དེ་ན།
en: It is there that Inconceivable Radiance, the Tathāgata, will appear;

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་འདི་སྐད་དུ་བསྐལ་པ་འདི་ནི་ཀུན་ཏུ་སྣང་བ་མེད་པ་ཀུན་ཏུ་སྣང་བ་མེད་པ་སྟེ། དེ་ལ་དེ་བཞིན་གཤེགས་པ་བྱུང་ངོ་། །
en: it is there where the Śuddhāvāsa gods say, ‘This eon lacks universal illumination. It lacks universal illumination, so may a tathāgata appear!’

source: ཞེས་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: His appearance is due to their giving voice to this purposeful interjection.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལུང་བསྟན་པ་བརྗོད་པ་འདི་བཤད་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན།
en: When this statement of prophecy about the bodhisattva Inconceivable Radiance was spoken,

source: ལྷ་དང་མིའི་སྲོག་ཆགས་སུམ་ཁྲི་ཉིས་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །
en: and this account of Dharma was taught, thirty-two thousand beings, gods and humans alike, generated the mind set on unsurpassed and perfect awakening.
